<?php
error_reporting(0);
header('Content-Type: text/json;charset=UTF-8');
$id = isset($_GET['id'])?$_GET['id']:'cctv1';
$n = [
  //央视
  'cctv1' => [1725,1632], //CCTV1
  'cctv1b' => [1734,1202], //CCTV1
  'cctv1c' => [2405,1710], //CCTV1*
  'dyjc' => [1793, 2311], // CCTV第一剧场
  //北京
  'hrtv' => [3278,4042], // 怀柔电视台
  'cptv' => [3341,3698], // 昌平电视台*
  //黑龙江
  'dqxwzh' => [2281,1463], // 大庆新闻综合
  'dqgg' => [2282,1463], // 大庆公共
  'dqjy' => [2283,1463], // 大庆教育
  'qqhexwzh' => [3239,4042], // 齐齐哈尔新闻综合
  'qqhejjfz' => [3240,4042], // 齐齐哈尔经济法治
  'nazh' => [2475,3543], // 宁安综合 牡丹江
  //辽宁
  'tlzh' => [2584,3816], // 铁岭综合
  'jptv1' => [1066,1332], // 金普一套 大连
  'jptv2' => [2598,1332], // 金普二套
  'ddxwzh' => [3307,4042], // 丹东新闻综合x
  //河北
  'jzzh' => [732,1724], // 冀州综合 衡水
  'hlzh' => [1222,1781], // 怀来综合 张家口
  'bdxwzh' => [3067,1630], // 保定新闻综合
  'bdgg' => [3068,1630], // 保定公共
  'bdshjk' => [3069,1630], // 保定生活健康

  //山西
  'hmxw' => [2125,2556], // 侯马新闻综合 临汾
  'qwxwzh' => [1203,2653], // 曲沃新闻综合 临汾
  'rczh' => [2511,3580], // 芮城综合 运城
  'lltv1' => [2652,2268], // 吕梁一套x
  'lltv2' => [2653,2268], // 吕梁二套x
  'lztv' => [1886,1723], //潞州电视台 长治
  'qxtv' => [2988,4048], //清徐电视台 太原
  //山东
  'jxxwzh' => [1306,2606], // 嘉祥新闻综合 济宁
  'jxsh' => [1307,2606], // 嘉祥生活
  'zbxwzh' => [2308,3185], //淄博新闻综合
  //安徽
  'ngxwzh' => [1588,2465], // 宁国新闻综合 宣城
  'aqxwzh' => [3214,4195], // 安庆新闻综合
  'aqjjsh' => [3215,4195], // 安庆经济生活
  'fdxwzh' => [1155,1167], // 肥东新闻综合 合肥
  'fdjjsh' => [2093,1167], // 肥东经济生活
  'dsxwzh' => [2334,1364], // 砀山新闻综合 宿州
  'dsjjwh' => [2336,1364], // 砀山经济文化
  'fyxwzh' => [2851,2577], //阜阳新闻综合
  'fyjy' => [2852,2577], // 阜阳教育
  'fygg' => [2853,2577], // 阜阳公共
  'fydswy' => [2854,2577], // 阜阳都市文艺
  'fnxwzh' => [2601,1469], // 阜南新闻综合 阜阳
  'hngg' => [3285,4164], // 淮南公共
  'tlxwzh' => [3335,1167], // 铜陵新闻综合*

  //河南
  'nyzh' => [142,1081], // 南阳新闻综合
  'nygg' => [295,1081], // 南阳公共
  'nykj' => [296,1081], // 南阳科教
  'pyxwzh' => [2480,3616], // 濮阳新闻综合
  'pygg' => [3017,3616], // 濮阳公共
  'pydsj' => [3332,3616], // 濮阳电视剧
  'sstv1' => [1085,2308], // 商水一套

  //湖北
  'yyzh' => [2900,3659], // 郧阳新闻综合 十堰
  'xyzh' => [3061,1500], // 襄阳综合
  'xygg' => [2337,1500], // 襄阳经济生活
  'xyjjsh' => [2675,1500], // 襄阳经济生活
  'szzh' => [304,1487], // 随州综合
  'sznc' => [305,1487], // 随州农村
  'cdxwzh' => [1982,3165], //蔡甸新闻综合 武汉
  'xzzh' => [2904,3951], //新洲综合
  'jlzh' => [2199,2013], //监利综合 荆州x
  'hsxwzh' => [3031,3065], //黄石新闻综合
  'hsds' => [3032,3065], //黄石都市
  'zbhs' => [3071,3065], //直播黄石x
  //湖南
  'hunws' => [2583,3815], //湖南卫视
  'hunws2' => [1726,1632], //湖南卫视2
  'hunws3' => [810,1689], //湖南卫视3
  'hunws4' => [680,1202], //湖南卫视4*
  'csxw' => [346,1648], // 长沙新闻
  'cszf' => [348,1648], // 长沙政法
  'csnx' => [349,1648], // 长沙女性
  'csys' => [350,1648], // 长沙影视
  'lyxw' => [1788,3275], // 浏阳新闻 长沙
  'xyinzh' => [800,1689], //  湘阴综合 岳阳
  'yyxwzh' => [1699,2193], // 岳阳新闻综合
  'yyxwzh2' => [812,1689], //岳阳新闻综合2
  'yykj' => [1700,2193], // 岳阳科教
  'yygg' => [1701,2193], // 岳阳公共
  'zzxwzh' => [2053,1366], // 株洲新闻综合
  'zzgg' => [2134,1366], // 株洲公共
  'syxtv' => [560,1590], //邵阳县电视台 邵阳
  'yzxwzh' => [567,1710], // 宜章新闻综合 郴州
  'dxzh' => [1343,2502], // 道县综合 永州x
  'nxtv' => [1724,1632], //南县新闻 益阳
  'xxxwzh' => [2581,3815], // 湘西综合
  'xxgg' => [2582,3815], // 湘西公共
  //江苏
  'jnzh' => [2505,3579], //江宁综合 南京
  'wxjy' => [1639,2019], // 无锡教育
  'wjxwzh' => [239,1079], // 吴江新闻综合 苏州
  'gyzh' => [777,1909], // 灌云综合 连云港
  'hazh' => [803,1610], // 淮安综合
  'hazh2' => [2778,1610], // 淮安综合2
  'hagg' => [808,1610], // 淮安公共
  'hagg2' => [2808,1610], // 淮安公共2
  'haysyl' => [902,1610], // 淮安影视娱乐
  'haysyl2' => [2807,1610], // 淮安影视娱乐2
  'xytv1' => [3177,1812], //新沂融媒电视1频道 徐州
  'xytv2' => [3178,1812], //新沂融媒电视2频道 徐州
  'xyldy' => [2648,1812], //新沂老电影 徐州
  'xzldy' => [2730,1206], //OBS无线徐州老电影x
  'rgxwzh' => [2862,1545], //如皋新闻综合 南通
  //浙江
  'lazh' => [2747,3568], // 临安综合 杭州
  'fyzh' => [1181,1482], // 富阳新闻综合 杭州
  'lpxw' => [2513,3767], //临平新闻 杭州
  'yqzh' => [171,1356], // 乐清综合 温州
  'yqxw' => [170,1356], // 乐清新闻
  'yjxwzh' => [1335,2768], // 永嘉新闻综合 温州
  'wlxwzh' => [911,1639], // 温岭新闻综合 台州
  'wlmsxx' => [1287,1639], // 温岭民生休闲
  'xcxw' => [1361,2840], // 新昌新闻 绍兴
  'xcsh' => [1362,2840], // 新昌生活
  'nhxwzh' => [1423,1329], // 宁海新闻综合 宁波
  'ajxw' => [1499,1253], // 安吉新闻综合 湖州
  'ajsh' => [1526,1253], // 安吉生活
  'ajys' => [1528,1253], // 安吉影视x
  'ywxwzh' => [1796,3071], //义乌新闻综合 金华
  'ywsm' => [2133,3071], //义乌商贸
  'ywggwy' => [3090,3071], //义乌公共文艺
  'cxxwzh' => [2760,1346], //慈溪新闻综合 宁波
  'cxmsxx' => [2761,1346], //慈溪民生休闲 宁波
  'cxystw' => [2762,1346], //慈溪影视图文 宁波
  'fhxwzh' => [3152,3512], //奉化新闻综合 宁波
  'fhshyl' => [3153,3512], //奉化生活娱乐 宁波
  'txxwzh' => [1511,1043], //桐乡新闻综合 嘉兴*
  'xjxwzh' => [1603,2515], //仙居新闻综合 台州*
   //福建
  'zztv1' => [175,1116], // 漳州一套
  'cltv' => [327,1653], // 长乐台 福州
  'fqzh' => [699,1945], // 福清综合 福州
  'mhzh' => [2068,2656], //闽侯综合 福州
  'mhzh2' => [2179,2656], //闽侯综合2
  'ptxwzh' => [907,1118], // 平潭新闻综合
  'ptlywh' => [908,1118], //平潭旅游文化
  'smtv1' => [1994,2303], // 三明1套HD
  'smtv2' => [1995,2303], // 三明2套HD
  'yazh' => [2597,3454], // 永安综合 三明
  'sxzh' => [425,1567], // 沙县综合 三明
  'yxxwzh' => [765,2055], // 尤溪新闻综合 三明
  'yxlyxc' => [767,2055], // 尤溪旅游宣传
  'qgtv' => [2333,3708], // 泉港一套 泉州
  'dhzh' => [2467,3164], // 德化综合 泉州
  'yctv1' => [1792,2311], // 永春综合 泉州
  'yctv2' => [1793,2311], // 永春公共 
  'zpzh' => [2803,3350], // 漳浦综合
  'jmzh' => [3102,4113], // 集美综合 厦门
  'lyzh' => [2697,1041],//龙岩综合*
  'lygg' => [2696,1041],//龙岩公共*
  //广东
  'xytv' => [643,1629], // 信宜电视台 茂名
  'kpzh' => [1434,1132], // 开平综合 江门
  'kpsh' => [1435,1132], // 开平生活
  //广西
  'lpzh' => [3080,4107], // 荔浦综合 桂林
  'ylzh' => [3289,4042], // 玉林新闻综合
  'ylgg' => [3290,4042], // 玉林公共频道
  //云南
  'kmzh' => [3143,4148], // 昆明新闻综合 云南
  'kmys' => [3185,4148], // 昆明影视综艺
  'kmjj' => [3192,4148], // 昆明经济生活
  'kmkj' => [3193,4148], // 昆明科学教育
  'kmms' => [3194,4148], // 昆明春城民生

 //贵州
  'yjtv' => [3043,4088], // 印江电视台 铜仁
  //四川
  'bzzh' => [246,1091], // 巴中综合
  'bzwlsh' => [247,1091], // 巴中文旅生活
  'baztv' => [1839,1091], //巴州电视 巴中
  'njtv' => [1670,1822], // 南江电视台 巴中
  'lxzh' => [1645,2392], // 泸县综合 泸州
  'mztv' => [1933,3277], //绵竹电视 德阳
  'shtv' => [391,1743], //射洪综合 遂宁
  //新疆
  'akstv1' => [2229,3643], // 阿克苏1套汉语综合
  'akstv2' => [2233,3643], // 阿克苏2套维语综合
  'aksdj' => [2234,3643], // 阿克苏党员远程教育
  'cjzh' => [3111,2687], // 昌吉综合
  'cjcssh' => [3057,2687], // 昌吉城市生活
  'cjcssh2' => [3058,2687], // 昌吉城市生活2
  'bejhyzh' => [3366,4239], // 布尔津汉语综合
  'bejhayzh' => [3377,4239], // 布尔津哈语综合

  //海南
  'dztv' => [1330,1669], // 儋州台 海南        
];

$url = 'https://1812501212048408.cn-hangzhou.fc.aliyuncs.com/2016-08-15/proxy/node-api.online/node-api/tv/getPlayAddress?id='.$n[$id][0].'&uin='.$n[$id][1].'&clientId=1';
$arr = [
      'q_KhUzRNviTQMw35AK7VUOsxUuO3fkLbRbWjHBywJErK0zgP7mqTsFvo50t7UieqiF-pvnPCIMJa5QdRQ1gLPBYWz9HOG7TAdI5vRG232V88z98QUcOS1P6iUQbACyEaoEVKLRe_Am23Ezeahvwg0pDBetjQHrLPx7P8mro2vqw15rvUQKLSF-HBByajerez',//sz*
      'xQtKveJFBYYdE5xPP5Qc5y3qlfhlj-BcHOcbWxez9NxCHHoFi0Lp44BN8aqi2_k9URCU-rsf8mQz8CYifgEaMzixzi63CT1KgCDexQ0cD5X0e0lUMZaQy0DMOXcFpW1Cf9zn7psgSNcUQiA2OGcxi7TXk-_FyDGcu767szWh8SQJ0Vr0uNRbiqE2jzk7ICiX',//sz*
      ];
$extra_key = $arr[array_rand($arr)];

$str = json_decode(get($url))->data->hlsUrl;
$m3u8 = preg_split("/&extra/",$str)[0]."&extra_key=".$extra_key;

header('Location:'.$m3u8);
//echo $m3u8;

function get($url){
    $ch = curl_init($url);
    curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);
    curl_setopt($ch, CURLOPT_REFERER,"https://web.guangdianyun.tv/");
    curl_setopt($ch, CURLOPT_SSL_VERIFYPEER, 0);
    curl_setopt($ch, CURLOPT_SSL_VERIFYHOST, 0);
    $data = curl_exec($ch);
    curl_close($ch);
    return $data;
}

?>
